/*
 Navicat Premium Data Transfer

 Source Server         : LJH
 Source Server Type    : MySQL
 Source Server Version : 80032
 Source Host           : localhost:3306
 Source Schema         : reginmen

 Target Server Type    : MySQL
 Target Server Version : 80032
 File Encoding         : 65001

 Date: 27/04/2023 17:53:16
*/

SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

-- ----------------------------
-- Table structure for topics
-- ----------------------------
DROP TABLE IF EXISTS `topics`;
CREATE TABLE `topics`  (
  `id` int(0) NOT NULL AUTO_INCREMENT,
  `name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `count` int(0) NULL DEFAULT NULL,
  `user_id` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL,
  `content` varchar(14000) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  `reviews_ids` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NULL DEFAULT NULL,
  PRIMARY KEY (`id`) USING BTREE,
  INDEX `user_id`(`user_id`) USING BTREE,
  CONSTRAINT `topics_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `user` (`id`) ON DELETE RESTRICT ON UPDATE RESTRICT
) ENGINE = InnoDB AUTO_INCREMENT = 21 CHARACTER SET = utf8mb4 COLLATE = utf8mb4_0900_ai_ci ROW_FORMAT = Dynamic;

-- ----------------------------
-- Records of topics
-- ----------------------------
INSERT INTO `topics` VALUES (1, '吃含钙食物不喝茶', 16040, '20210011', '草酸易与钙形成结石，而茶的成分中含有草酸，因此日常饮茶以浓淡适度且不过量为宜!尤其在实用富含钙质的食物后，不要马上喝茶!', '1,21');
INSERT INTO `topics` VALUES (2, '红枣并不是最补血', 12942, '20210011', '最补血的并不是红枣之类的食品，而是红肉、肝脏等物，这也是大多数素食爱好者贫血的原因。红肉、肝脏富含血红蛋白铁，能够有效补血，而植物含铁量低，不易被吸收。', '2,22,41');
INSERT INTO `topics` VALUES (3, '头皮屑过多可通过饮食改善', 44808, '20210011', '多吃碱性食物如水果、蔬菜、蜂蜜等；多吃含维生素B2、B6食 物，如动物肝、肾、心、奶类、蛋黄、麦胚等。', '3,23');
INSERT INTO `topics` VALUES (4, '益生菌能缓解高血压', 11792, '20210011', '最新研究表明：食用益生菌能够有效帮助缓解高血压症状，这些益生菌可通过酸奶或某些营养品补充获得。\r\n益生菌的保护效果对于基线高血压人群最为显着，并且补充多种益生菌的降压效果比补充单一细菌更好。长时间摄入一定量的益生菌是降压的关键，当具有规律性的食用益生菌时，就会有有助于降低血压，维持血压在一个正常的范围。\r\n这些食物包括发酵乳、酸奶、奶酪以及含益生菌的营养品。但是研究仅仅提示了益生菌与血压之间的联系，两者之间并不是直接的因果关系，也不要认为只吃酸奶就可以缓解高血压。\r\n多项研究结果显示，益生菌只能起到轻微降血压的作用，而且不同的实验者对于益生菌的摄取的量也有很大的差异，还需要进一步的深度挖掘。', '4,24');
INSERT INTO `topics` VALUES (5, '热水泡双手可治偏头痛', 40554, '20210011', '头痛难忍时，可试着把双手浸入热水中，水量以浸过手腕为宜，并不断地加热水，以保持水温。半小时后，痛感即可减轻，甚至完全消失。', '5,25');
INSERT INTO `topics` VALUES (6, '干嚼食物可以健脑', 23251, '20210011', '大部分干嚼食物都能够健脑，如核桃、杏仁等干果。干嚼有健脑的功能，可以提防大脑老化，从而预防老年痴呆症。', '6,26');
INSERT INTO `topics` VALUES (7, '常温牛奶比热牛奶更健康', 56221, '20210011', '牛奶加热时间越长，其中的钙成分流失得越快，而乳糖成分不会有任何变化。营养专家认为，常温牛奶比热牛奶更健康。\r\n小议建议：如果您非喝热牛奶不可，最好不要用微波炉加热，微波会让乳类蛋白变质，用煤气灶或者热水温烫比较合适。', '7,27');
INSERT INTO `topics` VALUES (8, '苹果应在15分钟内吃完', 11223, '20210011', '苹果中含有丰富的维生素和酸类物质，新西兰食品专家指出，如果吃苹果速度太慢，会让你胃部分泌大量胃酸，与果酸共同作用，造成消化不良！苹果一定在15分钟内吃完！', '8,28');
INSERT INTO `topics` VALUES (9, '吃完猕猴桃，不要立刻喝牛奶', 9023, '20210011', '猕猴桃中含有大量维生素C和维生素B，两者与牛奶中的乳脂蛋白相结合，容易产生蛋白质凝块，让你腹泻！\r\n小议建议：吃完猕猴桃2小时后再喝牛奶，或吃其他奶制品。', '9,29');
INSERT INTO `topics` VALUES (10, '晒被子不宜进行拍打', 15546, '20210011', '棉被的棉花纤维粗而短，很容易断裂。如果在晒被子时进行拍打，则会使棉花越来越细碎，变成棉尘跑出来，使被子保暖效果大打折扣。', '10.30');
INSERT INTO `topics` VALUES (11, '空腹不宜喝酸奶', 23215, '20210011', '酸奶含有大量乳酸菌，有保健作用。空腹时，人体胃酸分泌过多，不适宜乳酸菌的生长，使得保健效果减小，饭后两小时食用酸奶为最佳。', '11,31');
INSERT INTO `topics` VALUES (12, '中医说枸杞养生', 25468, '20210011', '常吃枸杞子能“坚筋骨、耐寒暑”。是滋补调养和抗衰老的良药。很多人都不知道常吃枸杞子可以美容。这因为，枸杞子可以提\r\n高皮肤吸收氧分的能力，另外，还能起到美白作用。《本草纲目》记载：“枸杞，补肾生精，养肝，明目，坚精骨，去疲劳，易颜色，变白，明目安神，令人长\r\n寿。”', '12,32');
INSERT INTO `topics` VALUES (13, '夏日养生菜之豆腐', 45123, '20210011', '豆腐的蛋白质含量丰富，而且豆腐蛋白属完全蛋白，不仅含有人体必需的八种氨基酸，而且比例也接近人体需要，营养价值较高;有降低血脂，保护血管细胞，预防心血管疾病的作用。此外，豆腐对病后调养、减肥、细腻肌肤亦很有好处。', '13,33');
INSERT INTO `topics` VALUES (14, '饭后养生', 9999, '20210011', '①吃得太油腻，喝杯芹菜汁;②吃火锅后喝点酸奶，保护胃肠道黏膜;③消化不良，饭后喝大麦茶或橘皮水;④吃方便面后吃水果，补偿维生素与矿物质的不足;⑤吃蟹后喝生姜红糖水，祛寒暖胃、促进消化、缓解胃部不适;⑥饭后吃个柿子，可润肺生津、养阴清燥。', '14,34');
INSERT INTO `topics` VALUES (15, '早餐喝什么最养生', 46454, '20210011', '1 、豆浆：适合怕胖者，有高血糖或贫血的;\r\n2 、纯牛奶：一般人都适合，但需要配主食，配坚果也不错;\r\n3、早餐奶：适合乳糖不耐受的人，需要制造饱腹感的人;\r\n4、 粥类：适合需要养胃的人，小米粥和山药粥都很温补;\r\n5、 果蔬汁：适合对清肠排毒有需求的人。', '15,35');
INSERT INTO `topics` VALUES (16, '夏日养生保健秘诀', 21254, '20210011', '五要三不宜 \r\n1、要保持情绪欢畅\r\n2要动静结合.\r\n3要注意饮食卫生\r\n4要多试试以热除热。\r\n5要适当吃些苦味食物夏令尤其需要。\r\n6不宜用饮料代替白开水7不宜睡砖石地上8不宜“快速冷却”。', '16,36');
INSERT INTO `topics` VALUES (17, '最好的运动方式', 36544, '20210011', '步行锻炼简便易行,尤其适宜于中老年人和体弱者的健身养生。步行能增强心血管系统功能,帮助心梗,中风的康复。正确的步行方法是：挺胸抬头，迈大步;手臂随脚步节奏摆动，并和呼吸节律同步。每天1或2次，每次30~60分钟，一周累计步行5次。以微微出汗为宜，坚持3~5周可见到成效。\n\n作者：素颐堂养生馆\n链接：https://www.jianshu.com/p/3ff150bc7969\n来源：简书\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。', '17,37');
INSERT INTO `topics` VALUES (18, '养生与颜色', 21546, '20210011', '《黄帝内经》根据五行学说，以人体五脏为中心，五色与五脏相配，即绿红黄白黑。红主心，绿主肝，黄主脾，白主肺，黑主肾。一般来说，春多吃绿(椰菜、黄瓜等)，夏多吃红(胡萝卜、番茄)，秋多吃白(白萝卜、银耳)，冬多吃黑(海带、黑芝麻)，四季吃黄(南瓜、植物种子)。\n\n作者：素颐堂养生馆\n链接：https://www.jianshu.com/p/3ff150bc7969\n来源：简书\n著作权归作者所有。商业转载请联系作者获得授权，非商业转载请注明出处。', '18,38');
INSERT INTO `topics` VALUES (19, '紫米养生', 12356, '20210011', '经常吃一些紫米。紫米，它属于温性的，它里面含有，比较丰富的维生素等一些营养成分，可以帮助我们补血益气，还可以帮助我们暖自己的脾胃。平常的时候，常吃一些，帮助我们缓解出现的胃疼，胃胀的现象。而且它里面的铁元素，含量比较高，可以帮助我们补充人体的气血，提高自己身体的免疫能力。它作为是养胃的好食品，经常吃一些，可以帮助我们减轻人体肠胃的负担，促进人体胃的蠕动力，胃不舒服的朋友，想要养护好自己的肠胃，可以常吃一些这样的米，帮助我们养生。', '19,39');
INSERT INTO `topics` VALUES (20, '不要发脾气啦', 48465, '20210011', '情绪上面切记烦躁。冬天的时候，气候干燥，人的情绪，就可能跟随天气的变化而出现变化，或是有时候，遇到什么不开心的事情，就特别容易发火，让自己的情绪烦躁，这对于冬季想要养生的我们来说，是没有任何一点好处的，人的情绪不好的话，我们身体里面的器官，是会跟着受到影响的。一个人经常发脾气，那这个人的身体新陈代谢，可能是会受到一些影响的，身体的各项功能，也许会受到失衡，进而可能造成身体出现一些疾病', '20,40');

SET FOREIGN_KEY_CHECKS = 1;
